zhkendy/TO50/CODE/SOURCE/Services/Archiver/STM8_Archiver.c
// **********************************************************************
// Copyright 2016 Somfy SAS  - IDDN.FR.001.110020.000.S.P.2016.000.31500  - All rights reserved.
// All reproduction, use, distribution of this software, in whole or in part, by any means, without SOMFY SAS's prior written approval, is strictly forbidden.
// ***********************************************************************

/**
* @file STM8_Archiver.c
* @brief Archiver manage persistant data write and load in eeprom.
* @details 
* @author Gabriel Mula
* @version xx
* @date Septembre 2015
*
*/
#include <string.h>                     //memcpy ext...
#include "CRC.h"                        //obvious...
#include "SFY_Macros.h"                 //GET_MSBYTE
#include "STM8_Archiver.h"
#include "SQC_DataProvider.h"

typedef struct Archiver_Pdata_SQC_s
{
  TU32 CriticalAreaWrite;     //关键区域写
  TU32 NormalAreaWrite;       //普通区域写
  TU8  CriticalAreaWriteFail; //关键区域写失败
  TU8  NormalAreaWriteFail;   //普通区域写失败
  TU8  CriticalAreaReadError; //关键区域读取错误
  TU8  CriticalAreaReadFail;  //关键区域读取失败
}Archiver_Pdata_SQC_s;

typedef struct Archiver_SQC_s
{
  TU16 SpaceUsedInByte;                                 ///< Space (in byte) used by registered object
  TU16 UsableSpace  ;                                   ///< Space (in byte) used by registered object
  Archiver_Pdata_SQC_s Counter;
}Archiver_SQC_s;

/**
*  @struct Object_FootPrint_t
*  @brief Data stored about an object by the archiver
*  @details The Archiver need some information about object. Those information are store in this structure.
*/
typedef struct
{
  void *pt_OnObjectInRam;                             ///< Pointer on registered object 
  void (*pf_SetToFactory)(void);                      ///< In case of corrupt block, this function will be called to reset object with default value
  TU8 Object_Size;                                    ///< object size in byte      
  TU8 Object_Eeprom_RelativeBlockStartAddress;        ///< Object address, relative to physical start of block adress. Exemple : Block start adress = 0x4000,Object address = 0x4004, Object_Eeprom_RelativeBlockStartAddress = 4
  TU8 Object_ParentLogicBlock;                        ///< Object is store in block number Object_ParentLogicBlock
}Object_FootPrint_t;

/**
*  @struct BlockType_e
*  @brief Type of Logical Block.
*  @details Archiver use two different type of block
*  The DataBlock, who do not replicate data in memorie and who are dangerous in case of write durring power cut
*  CriticalBlock, who replicate data in memorie and who are safe in case of write durring power cut
*/
typedef enum
{
  DataBlock,                    ///< Block is a simple data block, write once, no copy, write unsafe on powercut.普通数据块 写一次 不需要备份
  CriticalBlock,                ///< Block is a critical block, Copy are made, safe write.                       关键数据块 需要备份
}BlockType_e;

/**
*  @struct LogicBlockReg_t
*  @brief LogicBlock definition. 
*  @details Represent a logical block, store some important data like space left in block ext...
*/
typedef struct
{ 
  BlockType_e BlockType;                        ///< Block type @see BlockType_e           数据块类型
  TU8 FreeSpaceleft;                            ///< space left (in byte) in this block    剩余空间
  TU8 BlockRelativeFreePosition;                ///< Where the free space in block start (position relative to start of block).   空数据地址
  TU8 NumberOffObjectRegisteredInThisBlock;     ///< Count how many object are registered to this block                           已使用多少
  TU8 PhysicalBlockID;                          ///< Critical block use multiple contiguous physical block,So for BlockType == CriticalBlock, PhysicalBlockID is the first Physical Block of the Logical Block                                      
}LogicBlockReg_t;
                                                 
/**
*  @struct Archiver_t
*  @brief Archiver object Structure 
*  @details Store an array of registered objects and an array of block used by archiver
*/
typedef struct
{
  Archiver_SQC_s SQC;
  TU8 RegisteredObject_Ctr;                             ///< Counter of registered object
  
  Object_FootPrint_t RegisteredObject[MAX_NBR_OBJECT];  ///< Object footprint array. @see Object_FootPrint_t  25个数据
  LogicBlockReg_t    LogicBlock_Table[LOGIC_BLOCK_CNT]; ///< Block type array @see LogicBlockReg_t            5块
  TU8 WriteBuffer[FLASH_BLOCK_SIZE];                    ///< Buffer used on write operation                   写缓存大小128
}Archiver_t;


Archiver_t Archiver;
#define me Archiver


static TS8   Archiver_SearchBlockWithEnouthSpace(TU8 ObjectSizeInByte,TBool IsObjectCritical);
static void  Archiver_AllocatePhysicalBlock();
static TBool Archiver_IsBlockCorrupt(TU8 PhysicalBlock);
static TU16  Archiver_GetBlockCRC(TU8 PhysicalBlock);
static TU16  Archiver_ComputeBlockCRC(TU8 PhysicalBlock);
static TBool Archiver_WriteBufferToPhysicalBlock(TU8* Buffer,TU8 PhysicalBlock);
static TU16  Archiver_ComputeAndAppendCRC16ToBuffer(TU8 *Buffer,TU16 size);
static TBool Archiver_LoadWriteBuffer(TU8 LogicalBlock,TU8* Buffer);
static TS8   Archiver_GetFirstValidPhysicalBlockID(TU8 LogicalCriticalBlock);
static void  Archiver_LoadObject(TU8 SourcePhysicalBlockId,TU8 LogicalBlockToLoad);
static TBool Archiver_IsBlockVirgin(TU8 Block);
static TBool Archiver_IsAllVirgin();
static TU8*  Get_SQC_data(TU8* DataSize);
static void  Archiver_SetSQCToFactory();

static TS8  Archiver_SearchRegisteredObject(const void* Me);
static void Archiver_SetAllToFactory(void);
//static TU8  Archiver_ReadTU8(TU32 Address) ;
static TU16 Archiver_ReadTU16(TU32 Address);
//static TU32 Archiver_ReadTU32(TU32 Address);
static void Archiver_SetupHardware();



static TU8* Get_SQC_data(TU8* DataSize)
{
  *DataSize = sizeof(me.SQC);
  return (TU8*) &me.SQC;
}

void Archiver_NoSetToFactoryFunction()
{
}
 
/**
 * @brief Initialise Archiver object.
 * @details This function must be called before using Archiver Object. 
 *          It setup STM8 hardware, init Object_FootPrint_t Array and Setup LogicBlockReg_t Array according to definition in STM8_Archiver_Conf.h.
 *          Archiver object is unique (only one instance allowed).
 * @return Archiver_t UNIQUE instance address
 */
void Archiver_Init()
{
  Archiver_SetupHardware();                           //flash 操作配置时钟和解锁
  memset(Archiver.WriteBuffer,0x00,FLASH_BLOCK_SIZE); //写缓存清零  这128
  Archiver_AllocatePhysicalBlock();                   //分配存储块

  for(TU8 i = 0u;i<MAX_NBR_OBJECT;++i)               //MAX_NBR_OBJECT=25组
  {
    me.RegisteredObject[i].Object_Size = 0U;
    me.RegisteredObject[i].Object_Eeprom_RelativeBlockStartAddress = 0U;
    me.RegisteredObject[i].Object_ParentLogicBlock = 0xFF;
    me.RegisteredObject[i].pt_OnObjectInRam = NULL;
  }
  
  me.SQC.SpaceUsedInByte  = 0U; //空间使用
  me.RegisteredObject_Ctr = 0U; //记录目标计数

  //SQC 
  SQC_DataProviderNameInterface_s intf;
  intf.Fptr_Get = Get_SQC_data;
  SQC_DataProvider_RegisterDataSource(SQC_DataProvider_Archiver ,&intf);
  
  Archiver_RegisterObject(&me.SQC.Counter,
                          Archiver_SetSQCToFactory,
                          sizeof(me.SQC.Counter),
                          FALSE);   
}

void Archiver_Create()   //存储数据创建
{
  if(Archiver_IsAllVirgin() == TRUE)  //存储数据为空则恢复出厂设置
  {
     Archiver_SetAllToFactory();
     Archiver_SaveAllObject();
  } 
    Archiver_LoadMe(&me.SQC.Counter); //EEPROM操作导入参数
}

