zhkendy/TO50/CODE/SOURCE/Services/Archiver/STM8_Archiver.c
void Archiver_ResetCreate()   //存储数据创建
{
    Archiver_SetAllToFactory();
    Archiver_SaveAllObject();
    Archiver_LoadMe(&me.SQC.Counter); //EEPROM操作导入参数
}

//存储标志恢复出厂设置
static void Archiver_SetSQCToFactory()
{
  me.SQC.Counter.CriticalAreaReadError = 0u;
  me.SQC.Counter.CriticalAreaReadFail= 0u;
  me.SQC.Counter.CriticalAreaWrite= 0u;
  me.SQC.Counter.CriticalAreaWriteFail= 0u;
  me.SQC.Counter.NormalAreaWrite= 0u;
  me.SQC.Counter.NormalAreaWriteFail= 0u;
}

/**
 * @brief build LogicBlock_Table  创建逻辑块列表
* @details Archiver use a static organisation of memories block : \n
 * [ --------------------------------------Critical Area-----------------------------------------]      [--------Data area------------]\n
 *  critical block N, copy of critical block N,critical block N+1 , copy of critical block N+1............Data Block D,Data block D+1...
 */
static void Archiver_AllocatePhysicalBlock()
{
  TU8 PhysicalBlockID = 0U;
  TU8 LogicalBlock    = 0U;
  
  for(LogicalBlock = 0U; LogicalBlock < CRITICAL_BLOCK_CNT;++LogicalBlock)//CRITICAL_BLOCK_CNT  = 1
  {
    me.LogicBlock_Table[LogicalBlock].FreeSpaceleft = FLASH_BLOCK_SIZE - CRC_LENGHT;
    me.LogicBlock_Table[LogicalBlock].BlockRelativeFreePosition = 0U;
    me.LogicBlock_Table[LogicalBlock].NumberOffObjectRegisteredInThisBlock = 0U;
    me.LogicBlock_Table[LogicalBlock].BlockType = CriticalBlock;          //关键数据块
    me.LogicBlock_Table[LogicalBlock].PhysicalBlockID = PhysicalBlockID;
    PhysicalBlockID += (1 + CRITICAL_BLOCK_COPY);
  }
  for(LogicalBlock = CRITICAL_BLOCK_CNT; LogicalBlock < LOGIC_BLOCK_CNT;++LogicalBlock) //CRITICAL_BLOCK_CNT  = 1   LOGIC_BLOCK_CNT = 5
  {
    me.LogicBlock_Table[LogicalBlock].FreeSpaceleft = FLASH_BLOCK_SIZE - CRC_LENGHT; //128-2=126
    me.LogicBlock_Table[LogicalBlock].BlockRelativeFreePosition = 0U;
    me.LogicBlock_Table[LogicalBlock].NumberOffObjectRegisteredInThisBlock = 0U;
    me.LogicBlock_Table[LogicalBlock].BlockType = DataBlock;                         //普通数据块
    me.LogicBlock_Table[LogicalBlock].PhysicalBlockID = PhysicalBlockID;
    PhysicalBlockID += 1;
  }
  me.SQC.UsableSpace = (LOGIC_BLOCK_CNT * (FLASH_BLOCK_SIZE - CRC_LENGHT));//5*126
}

/**
 * @brief Setup STM8 Eeprom Hardware   ok sage
 */
static void Archiver_SetupHardware()
{

  /* Define FLASH programming time */
  FLASH_SetProgrammingTime(FLASH_PROGRAMTIME_STANDARD);
  
  /* Unlock Data memory */
  FLASH_Unlock(FLASH_MEMTYPE_DATA);
}


/**
 * @brief Register an object in the Archiver object
 * @details Any object managed by archiver must be registered. An object registered can ben save in and restore from eeprom.
 * @param obj Object that must be registered
 * @param pf_SetToFactory Function pointer that must be called to reset object to factory value.
 * @param ObjectSize Object total size in Byte
 * @param IsCritical True if the object must be reister in the critical area. FALSE else.
 * @return True if oject is successfully registered. false else. 
 */
TBool Archiver_RegisterObject( void *obj,void (*pf_SetToFactory)(void),TU8 ObjectSize,TBool IsCritical)
{
  TS8 FreeBlock = Archiver_SearchBlockWithEnouthSpace(ObjectSize,IsCritical);
  TBool Rtn = FALSE;
  if(FreeBlock != -1)
  {    
    me.RegisteredObject[me.RegisteredObject_Ctr].Object_Size = ObjectSize;           //目标数据大小
    me.RegisteredObject[me.RegisteredObject_Ctr].pf_SetToFactory  = pf_SetToFactory; //安全参数值 出厂参数
    me.RegisteredObject[me.RegisteredObject_Ctr].pt_OnObjectInRam = obj;             //存储目标
    me.RegisteredObject[me.RegisteredObject_Ctr].Object_Eeprom_RelativeBlockStartAddress = me.LogicBlock_Table[FreeBlock].BlockRelativeFreePosition;
    me.RegisteredObject[me.RegisteredObject_Ctr].Object_ParentLogicBlock = (TU8) FreeBlock;
    ++me.RegisteredObject_Ctr;             //记录目标增加
    me.SQC.SpaceUsedInByte += ObjectSize;  //已使用空间
    
    me.LogicBlock_Table[FreeBlock].BlockRelativeFreePosition += ObjectSize;//位置
    me.LogicBlock_Table[FreeBlock].FreeSpaceleft -= ObjectSize;            //剩余空间
    me.LogicBlock_Table[FreeBlock].NumberOffObjectRegisteredInThisBlock += 1;

    Rtn = TRUE;
  }

  return Rtn;
}

/**
 * @brief Search a block with enouth space.
 * @param ObjectSizeInByte Object size in byte.
 * @param IsObjectCritical Trus if the object is critical and must be registered in critical area
 * @return return -1 if there is not enouth space, else return the logicblock index.
 */
static TS8 Archiver_SearchBlockWithEnouthSpace(TU8 ObjectSizeInByte,TBool IsObjectCritical)
{
  TU8 Start,Stop;
  TS8 Rtn = -1;
  if(IsObjectCritical == TRUE)//是关键数据区域
  {
    Start = 0U;
    Stop = CRITICAL_BLOCK_CNT - 1;
  }else                       //是普通数据区域
  {
    Start = CRITICAL_BLOCK_CNT;
    Stop = LOGIC_BLOCK_CNT - 1;
  }
  
  for(TU8 i=Start;i<=Stop && Rtn == -1 ;++i)
  {
    if(Archiver.LogicBlock_Table[i].FreeSpaceleft >= ObjectSizeInByte)
    {
      Rtn = (TS8)i;
    }
  }
  return Rtn;
}

/**
 * @brief Test if data have ben corrupted
 * @details The function compare the CRC16 store at the end of the physical block to a crc re-compute on data of the block.
 * @param PhysicalBlock Physical block to test.
 * @return return True if the block is corrupt. False else.
 */
static TBool Archiver_IsBlockCorrupt(TU8 PhysicalBlock)
{
  return (Archiver_ComputeBlockCRC(PhysicalBlock) == Archiver_GetBlockCRC(PhysicalBlock)) ? (FALSE) : (TRUE);
}

/**
 * @brief Get the CRC16 store at the end of the block
 * @param PhysicalBlock to read
 * @return The Block CRC
 */
static TU16 Archiver_ComputeBlockCRC(TU8 PhysicalBlock)
{
  TU16 CRC = 0u;
  CRC_Init(&CRC);
  TU32 StartArea = Bloc_AStart_Adress_Table[PhysicalBlock];
  TU8 PointerAttr * Pt = &(*((TU8 PointerAttr *)((MemoryAddressCast)StartArea)));
  CRC_ComputeArray(&CRC,(TU8*)Pt,FLASH_BLOCK_SIZE-CRC_LENGHT);
  return CRC;
}

/**
 * @brief Read a block, and compute it CRC16
 * @param PhysicalBlock Physical block to test.
 * @return computed CRC of the block
 */
static TU16 Archiver_GetBlockCRC(TU8 PhysicalBlock)
{
  return Archiver_ReadTU16(Bloc_AStop_Adress_Table[PhysicalBlock] - (CRC_LENGHT - 1));
}

/**
 * @brief Read a TU8 in eeprom
 * @param Address Physical address to read
 * @return The byte at Address
 */
//static TU8 Archiver_ReadTU8(TU32 Address)
//{
//  return *((TU8 PointerAttr *)((MemoryAddressCast)Address));
//}

/**
 * @brief Read a TU16 in eeprom
 * @param Address Physical address to read
 * @return The TU16 at Address
 */
static TU16 Archiver_ReadTU16(TU32 Address)
{
  return *((TU16 PointerAttr *)((MemoryAddressCast)Address));
}

/**
 * @brief Read a TU32 in eeprom
 * @param Address Physical address to read
 * @return The TU32 at Address
 */
//static TU32 Archiver_ReadTU32(TU32 Address)
//{
//  return *((TU32 PointerAttr *)((MemoryAddressCast)Address));
//}

/**
 * @brief Save all (critical or not) registered object
 * @details It's a buffered write. Object of one block are copied in a writebuffer. Then CRC is compute and append to the buffer. Then the entiere buffer is wrote in eeprom
 * CRC is check after write. <b> Write until success write</b>
*/
void Archiver_SaveAllObject(void)
{
  TBool Error = FALSE; 

  Archiver_SaveOnlyCriticalObject(); 
  
