zhkendy/TO50/CODE/SOURCE/Services/Archiver/STM8_Archiver.c
  //For each Logical block
  for(TU8 Logical = CRITICAL_BLOCK_CNT; Logical < LOGIC_BLOCK_CNT; ++Logical)//1   5
  {
    //Copy all object registered in the current block to the writebuffer. Skip if nothing in this block
    if(Archiver_LoadWriteBuffer(Logical,me.WriteBuffer) == TRUE)
    {
      //Compute and append CRC16 to write buffer
      TU16 CRC = Archiver_ComputeAndAppendCRC16ToBuffer(me.WriteBuffer,FLASH_BLOCK_SIZE);

      //get the  physical block id of the logical block
      TU8 PhysicalBlockID = me.LogicBlock_Table[Logical].PhysicalBlockID;
      //Then write the buffer in eeprom
      if(Archiver_WriteBufferToPhysicalBlock(me.WriteBuffer,PhysicalBlockID)== FALSE)
      {
        Error = TRUE;
      }
    }   
  }

  if(Error == TRUE)
  {//普通区域写失败
    SQC_Count(&me.SQC.Counter.NormalAreaWriteFail,sizeof(me.SQC.Counter.NormalAreaWriteFail));
  }
  else
  {//普通区域写正常
    SQC_Count(&me.SQC.Counter.NormalAreaWrite,sizeof(me.SQC.Counter.NormalAreaWrite));
  }
}


/**
 * @brief Save only critical object.  只存储关键数据
 * @details It's a buffered write. Object of one block are copied in a writebuffer. 
 * Then CRC is compute and append to the buffer. Then the entiere buffer is wrote in eeprom.
 * CRC is check after write. All required copy are write, the a new logical block is load. 
 * <b> Write of each block until success </b>
*/
void Archiver_SaveOnlyCriticalObject(void)
{

  TBool Error = FALSE; 
  //For each LogicalCritical block
  for(TU8 LogicalCritical = 0U; LogicalCritical < CRITICAL_BLOCK_CNT; ++LogicalCritical)
  {
    //Copy all object registered in the current critical block to the writebuffer. Skip if nothing in this block

    if(Archiver_LoadWriteBuffer(LogicalCritical,me.WriteBuffer) == TRUE)
    {
      //Compute and append CRC16 to write buffer
      TU16 CRC = Archiver_ComputeAndAppendCRC16ToBuffer(me.WriteBuffer,FLASH_BLOCK_SIZE);

      //get the first physical id of the logical critical block
      TU8 PhysicalBlockID = me.LogicBlock_Table[LogicalCritical].PhysicalBlockID;
      //Then write the buffer in eeprom, and all it copy
      for(TU8 Copy = 0U; Copy <= CRITICAL_BLOCK_COPY; ++Copy)
      {
        if(Archiver_WriteBufferToPhysicalBlock(me.WriteBuffer,PhysicalBlockID + Copy) == FALSE)
        {

          Error = TRUE;
        }
        else
        {
//          DEBUGPRINT("Write Success\n")
        }
      }
    }
  }
  
  if(Error == TRUE)
  {//写失败 置标志
    SQC_Count(&me.SQC.Counter.CriticalAreaWriteFail,sizeof(me.SQC.Counter.CriticalAreaWriteFail));
  }
  else
  {//写成功 置标志
    SQC_Count(&me.SQC.Counter.CriticalAreaWrite,sizeof(me.SQC.Counter.CriticalAreaWrite));
  }

}




/**
 * @param LogicalBlock The block to prepare to be write (all registered object of this block will be loaded in write buffer)
 * @param Buffer Temporary buffer to fill
 * @return FALSE if nothing to write, TRUE if there is data to write
*/
static TBool Archiver_LoadWriteBuffer(TU8 LogicalBlock,TU8* Buffer)
{
  TBool Rtn = FALSE;
  if(me.LogicBlock_Table[LogicalBlock].NumberOffObjectRegisteredInThisBlock != 0)
  {
     Rtn = TRUE;
    //PositionInBuffer represent the current position in the write buffer
    TU8 PositionInBuffer = 0U;
    
    //Clean the buffer
    memset(Buffer,0x00,FLASH_BLOCK_SIZE);   
    
    //Loop throw all registered object to find object registered in this block
    for(TU8 i = 0u;i<me.RegisteredObject_Ctr;++i)
    {
      //when object is registered in the block
      if(me.RegisteredObject[i].Object_ParentLogicBlock == LogicalBlock)
      {
        //Copy it to buffer
        void *Destination = (Buffer + PositionInBuffer);
        memcpy(Destination,me.RegisteredObject[i].pt_OnObjectInRam,me.RegisteredObject[i].Object_Size);
        PositionInBuffer += me.RegisteredObject[i].Object_Size;
      }
    }
  }
  
  return Rtn;
}


/**
 * @brief save Buffer into block. <b> The function loop until successfull write </b>
 * @param Buffer Pointer to eeprom block size buffer to write
 * @param PhysicalBlock Physical eeprom Block to write in
*/
static TBool Archiver_WriteBufferToPhysicalBlock(TU8* Buffer,TU8 PhysicalBlock)
{
  TU8 attempts = 0U;
  do
  {
    FLASH_ProgramBlock(PhysicalBlock,FLASH_MEMTYPE_DATA,FLASH_PROGRAMMODE_STANDARD,Buffer);
    FLASH_WaitForLastOperation(FLASH_MEMTYPE_DATA);
    attempts++;
  }while(Archiver_IsBlockCorrupt(PhysicalBlock) == TRUE && attempts < 5u);
  
  return (attempts < 5u) ? (TRUE) : (FALSE);
}

/**
 * @brief Compute and append CRC16 of the buffer
 * @param Buffer Buffer to compute CRC of
 * @param size Size of the Buffer
 * @return CRC16 append at the end of the buffer
 * @note Data on the two last room of the buffer are overewrite without any verification.
*/
static TU16 Archiver_ComputeAndAppendCRC16ToBuffer(TU8 *Buffer,TU16 size)
{
  TU16 CRC=0;
  CRC_Init(&CRC);
  CRC_ComputeArray(&CRC,Buffer,size-CRC_LENGHT);
  Buffer[size-2] = GET_MSBYTE(CRC);
  Buffer[size-1] = GET_LSBYTE(CRC);
  return CRC;
}


/**
 * @brief Load an object in the specified block
 * @param SourcePhysicalBlockId Physical eeprom block to read from
 * @param ObjectID Object number to read in SourcePhysicalBlockId
 * @note <b> SourcePhysicalBlockId is not check by the function. coherance of ObjectID and SourcePhysicalBlockId is not check </b>
*/
static void Archiver_LoadObject(TU8 SourcePhysicalBlockId,TU8 ObjectID)
{
  void *Destination = me.RegisteredObject[ObjectID].pt_OnObjectInRam;
  const void* Source = (void*)(Bloc_AStart_Adress_Table[SourcePhysicalBlockId] + me.RegisteredObject[ObjectID].Object_Eeprom_RelativeBlockStartAddress);
  TU8 size = me.RegisteredObject[ObjectID].Object_Size;
  memcpy(Destination,Source,size);
}

/**
 * @brief Parse Physical block of the specified logical critical block and return the first non corrupt block ID 
 * @param LogicalCriticalBlock Logical block to parse
 * @return The first valid physical block id. If all block are corrupt, return -1
*/
static TS8 Archiver_GetFirstValidPhysicalBlockID(TU8 LogicalCriticalBlock)
{
  TU8 PhysicalBlockID = me.LogicBlock_Table[LogicalCriticalBlock].PhysicalBlockID;
  TS8 Rtn = -1;
  for(TU8 i = PhysicalBlockID; i <= (PhysicalBlockID + CRITICAL_BLOCK_COPY) && Rtn == -1 ;++i)
  {
    TBool Corrupt = Archiver_IsBlockCorrupt(i);
    TBool Virgin  = Archiver_IsBlockVirgin(i);
    
    if(Corrupt == FALSE && Virgin == FALSE)
    {
      Rtn = (TS8) i;
    }
    else if(Corrupt == TRUE)
    {//关键区域读取错误
      SQC_Count(&me.SQC.Counter.CriticalAreaReadError,sizeof(me.SQC.Counter.CriticalAreaReadError));
    }
  }  //关键区域读取失败
  SQC_Count(&me.SQC.Counter.CriticalAreaReadFail,sizeof(me.SQC.Counter.CriticalAreaReadFail));
  return Rtn;
}


/**
 * @brief Check if a Block is virgin. On STM8, eeprom initial state is fill with 0.
 * @param Block Physical eeprom block to test 
 * @return TRUE if the block is virgin (filled with 0)
*/
static TBool Archiver_IsBlockVirgin(TU8 Block)
{
  TU32 StartArea = Bloc_AStart_Adress_Table[Block];
  TU32 EndOfArea = Bloc_AStop_Adress_Table[Block];
  
  TU8 PointerAttr * Pt    = &(*((TU8 PointerAttr *)((MemoryAddressCast)StartArea)));
  TU8 PointerAttr * Ptend = &(*((TU8 PointerAttr *)((MemoryAddressCast)EndOfArea)));
  
  while(*Pt == 0u && Pt < Ptend)
  {
    ++Pt;
  }
    
  return ( Pt == Ptend) ? (TRUE) : (FALSE);
}

/**
 * @brief Check if the critical area is virgin
 * @return TRUE if all block of the critical area are virgin
*/
static TBool Archiver_IsAllVirgin()
{
  TBool Rtn = TRUE;
  for(TU8 i = 0u ; i < FLASH_DATA_BLOCKS_COUNT && Rtn == TRUE; ++i)
  {
    if(Archiver_IsBlockVirgin(i) == FALSE)
    {
      Rtn = FALSE;
    }
  }
  return Rtn;
}


/**
 * @brief Set all registered object to their factory value
 * @details This funtion parse all registered object and call the pf_SetToFactory() callback function.
*/
 //设置所有记录目标为出厂值
 void Archiver_SetAllToFactory(void)
{
  for(TU8 i = 0U; i < me.RegisteredObject_Ctr;++i)
  {
    me.RegisteredObject[i].pf_SetToFactory();
  }
}



void Archiver_LoadMe(void *Me)
{
  //Search for the object in RegisteredObject array
  TS8 ObjectNumber = Archiver_SearchRegisteredObject(Me);
  if(ObjectNumber != -1)
  {
    //Object found. Check if it's a critical Object or a normal object, load procedure is slightly different  
    TU8 LogicalBlockSource = me.RegisteredObject[ObjectNumber].Object_ParentLogicBlock;
    if(me.LogicBlock_Table[LogicalBlockSource].BlockType == DataBlock) //如果是普通数据
    {
      //Check if data are corrupt. If they are, set factory value
      if(Archiver_IsBlockCorrupt(me.LogicBlock_Table[LogicalBlockSource].PhysicalBlockID) == TRUE)
      {
        me.RegisteredObject[ObjectNumber].pf_SetToFactory();
      }
      else
      {
        //Block is not corrupt, you can load data
        Archiver_LoadObject(me.LogicBlock_Table[LogicalBlockSource].PhysicalBlockID,ObjectNumber);
      }
    }
    else
    {//如果是关键数据
       TS8 ValidPhysicalBlock = Archiver_GetFirstValidPhysicalBlockID(LogicalBlockSource);
       if(ValidPhysicalBlock == -1)
       {
         //The Complete Critical area is corrupt !!!! Set to factory
          me.RegisteredObject[ObjectNumber].pf_SetToFactory();
       }
       else
       {
          Archiver_LoadObject(ValidPhysicalBlock,ObjectNumber);
       }
    }
  }
  else
  {
    //You have forget to register this object in archiver...
    trap();
  }
}
static TS8 Archiver_SearchRegisteredObject(const void* Me)
{
  TS8 Rtn = -1;
  for(TU8 i = 0u; ( (i < me.RegisteredObject_Ctr) && (Rtn == -1) ) ;++i)
  {
    //Check in registered object list if the object is know
    if(Archiver.RegisteredObject[i].pt_OnObjectInRam == Me)
    {
      Rtn = (TS8) i;
    }
  }
  return Rtn;
}

TBool Motor_Parameter_BackUp(TU32 Address, TU8 Me)
{
   TBool Rtn = FALSE;
   
    /*Define FLASH programming time*/
    FLASH_SetProgrammingTime(FLASH_PROGRAMTIME_STANDARD);
    /* Unlock Data memory */
    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    FLASH_ProgramByte(Address, Me);

    /* Check program word action */
    if(Me == FLASH_ReadByte(Address))
      Rtn= TRUE;
    FLASH_Lock(FLASH_MEMTYPE_DATA);
    
    return Rtn;    
}

TU8 Motor_Parameter_Read(TU32 Address)
{
  TU8 Me=0;
  Me = FLASH_ReadByte(Address);
  return Me; 
}
